import { Component, OnInit } from '@angular/core';

/*

<html>
    <head>
        <title>
            Books | Favorites
        </title>
    </head>
    <body>
        <h1>My Top 5 Books</h1>
        <h1>המוסד השמיימי</h1>
        <h2>  אייזק אסימוב</h2>
        <h3> 1951 </h3>
        <h4> עם עובד</h4>
        <h5> 300</h5>
        <p>אולי זה קצת קלישאתי, אבל הספר הזה, שיצא בשנת 1951 ותורגם לעברית בשנת 1978 הצית לבבות של מיליוני קוראים ברחבי העולם, ועורר תהייה לגבי גלקסיות רחוקות הרבה לפני מלחמת הכוכבים</p>

        <h1>המשחק של אנדר</h1>
        <h2>אורסון סקוט קארד</h2>
        <h3>1985</h3>
        <h4>הוצאת אופס</h4>
        <h5>308</h5>
        <p>אין לי מה לחפור על הספר כי אפשר להגיד עליו הכל במשפט אחד:
            
             אחד הספרים (ובכללי הסדרה) הטובים ביותר שקראתי אם לא הכי טוב.</p>

        <h1> חולית</h1>
        <h2>פרנק העובדרברט</h2>
        <h3>עם </h3>
        <h4>1997</h4>
        <h5>644</h5>
        <p>חולית הוא ספר מד"ב שפורץ את גבולות הז'אנר לכוון אחר - מרתק ומיוחד שהפכו אותו לספר מעולה בעשיריה הראשונה של המד"ב מאז ומעולם. </p>

        <h1> היפריון</h1>
        <h2> דן סימונס</h2>
        <h3> הוצאת אופוס</h3>
        <h4>1999</h4>
        <h5>444</h5>
        <p>עלילת הספר מרתקת וסוחפת, יפה איך סיפורי הדמויות- נובלות עצמאיות, שלכאורה אינן קשורות, נשזרות זו בזו בסופו של דבר ונטמעות בסיפור המרכזי בצורה שאינה מאפשרת לעזוב את הספר.</p>

        <h1> צד שמאל של החושך
         </h1>
        <h2> אורסולה לה-גווין</h2>
        <h3>ינשוף </h3>
        <h4>2005</h4>
        <h5> 352</h5>
        <p>"צד שמאל של החושך" כל כך נקי ומזוקק, עמוק ומרחיק לכת, עד שכמעט ולא היה לי זמן לבחון אותו מכל צדדיו כי נסחפתי פנימה.
            
             איזה כיף זה היה.</p>

       


    </body>
</html>

*/
interface book {
  title: string,
  authots: string[],
  publishedDate: Date,
  publisher: string,
  pages: number,
  commit: string
}

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})

export class AppComponent implements OnInit {


  books:book[] = [];

  ngOnInit() {

    const book1:book = {
      title:"המוסד השמיימי",
      authots: ["אייזק אסימוב"],
      publishedDate: new Date("1950"),
      publisher: "עם עובד",
      pages: 300,
      commit: "אולי זה קצת קלישאתי, אבל הספר הזה, שיצא בשנת 1951 ותורגם לעברית בשנת 1978 הצית לבבות של מיליוני קוראים ברחבי העולם, ועורר תהייה לגבי גלקסיות רחוקות הרבה לפני מלחמת הכוכבים"
    }
    const book2:book = {
      title:"המשחק של אנדר",
      authots: ["אורסון סקוט קארד"],
      publishedDate: new Date("1985"),
      publisher: "הוצאת אופס",
      pages: 308,
      commit: "אין לי מה לחפור על הספר כי אפשר להגיד עליו הכל במשפט אחד: אחד הספרים (ובכללי הסדרה) הטובים ביותר שקראתי אם לא הכי טוב."
    }
    const book3:book = {
      title:"חולית",
      authots: ["אייזק אסימוב"],
      publishedDate: new Date("1950"),
      publisher: "עם עובד",
      pages: 444,
      commit: "אולי זה קצת קלישאתי, אבל הספר הזה, שיצא בשנת 1951 ותורגם לעברית בשנת 1978 הצית לבבות של מיליוני קוראים ברחבי העולם, ועורר תהייה לגבי גלקסיות רחוקות הרבה לפני מלחמת הכוכבים"
    }
    const book4:book = {
      title:"היפריון",
      authots: ["אייזק אסימדן סימונס"],
      publishedDate: new Date("1999"),
      publisher: "הוצאת אופוס",
      pages: 300,
      commit: "אולי זה קצת קלישאתי, אבל הספר הזה, שיצא בשנת 1951 ותורגם לעברית בשנת 1978 הצית לבבות של מיליוני קוראים ברחבי העולם, ועורר תהייה לגבי גלקסיות רחוקות הרבה לפני מלחמת הכוכבים"
    }
    const book5:book = {
      title:"היפריון",
      authots: ["אייזק אסימוב"],
      publishedDate: new Date("1950"),
      publisher: "עם עובד",
      pages: 300,
      commit: "אולי זה קצת קלישאתי, אבל הספר הזה, שיצא בשנת 1951 ותורגם לעברית בשנת 1978 הצית לבבות של מיליוני קוראים ברחבי העולם, ועורר תהייה לגבי גלקסיות רחוקות הרבה לפני מלחמת הכוכבים"
    }

    this.books.push(book1);
    this.books.push(book2);
    this.books.push(book3);
    this.books.push(book4);
    this.books.push(book5);

  }
}
